package com.ruoyi.system.outto.dto.yx7881.bean;

import lombok.Data;

@Data
public class YxlmInfo {
    //"id":"333496",
    //            "keyname":"能否二次",
    //            "keyid":"code1",
    //            "type":"select",
    //            "value":"可二次,不可二次",
    //            "must":true,
    String code1;
        //"id":"1100",
        //            "keyname":"等级",
        //            "keyid":"level",
        //            "type":"text",
        //            "value":"level",
        //            "must":true,
    String level;
        // "id":"1109",
        //            "keyname":"游戏账号",
        //            "keyid":"gameaccount",
        //            "type":"text",
        //            "value":null,
        //            "must":true,
    String gameaccount;
        //"id":"1110",
        //            "keyname":"游戏密码",
        //            "keyid":"gamepassword",
        //            "type":"password",
        //            "value":null,
        //            "must":true,
    String gamepassword;
        // "id":"62583",
        //            "keyname":"英雄数量",
        //            "keyid":"heroCount",
        //            "type":"text",
        //            "value":"hero",
        //            "must":true,
    String heroCount;
        // "id":"1111",
        //            "keyname":"确认输入密码",
        //            "keyid":"gamepassword2",
        //            "type":"password",
        //            "value":null,
        //            "must":false,
    String gamepassword2;
        //"id":"62584",
        //            "keyname":"皮肤数量",
        //            "keyid":"skinCount",
        //            "type":"text",
        //            "value":"skin",
        //            "must":true,
    String skinCount;
        //""id":"333497",
        //            "keyname":"炫彩数量",
        //            "keyid":"code11",
        //            "type":"text",
        //            "value":null,
        //            "must":true,
//    String colorSkinCount;
    String code11;
        // "id":"62585",
        //            "keyname":"单双排位段位",
        //            "keyid":"select",
        //            "type":"select",
        //            "value":"未定级,黑铁,黄铜,白银,黄金,铂金,钻石,大师,宗师,王者",
        //            "must":true,
    String select;
        // "id":"1112",
        //            "keyname":"游戏角色名称",
        //            "keyid":"gamerole",
        //            "type":"text",
        //            "value":null,
        //            "must":true,
    String gamerole;
        // "id":"322509",
        //            "keyname":"灵活组排段位",
        //            "keyid":"code12",
        //            "type":"select",
        //            "value":"未定级,黑铁,黄铜,白银,黄金,铂金,钻石,大师,宗师,王者",
        //            "must":true,
//    String lhzpdw;
    String code12;
        //  "id":"322510",
        //            "keyname":"云顶之弈段位",
        //            "keyid":"code13",
        //            "type":"select",
        //            "value":"未定级,黑铁,黄铜,白银,黄金,铂金,钻石,大师,宗师,王者",
        //            "must":true,
    String code13;
        // "id":"333498",
        //            "keyname":"珍稀头像",
        //            "keyid":"code14",
        //            "type":"checkbox",
        //            "value":"无,燃烧花,女巫头,娜美头,猪妹头,奥莉安娜头,琴女手办,福神店长,雪花头\t,小鹿头",
        //            "must":true,
//    String zxtx;
    String code14;
        // "id":"333499",
        //            "keyname":"热门头像",
        //            "keyid":"code15",
        //            "type":"checkbox",
        //            "value":"无,星守阿狸,璐璐手办,爱情鸽,爱心头,爱情之歌,觅心游侠卢锡安,觅心之翼奎因,周年男刀,玉剑传说寒潭夭夭,玉剑传说苍鸾,卡特琳娜的匕首,拓蛙,黑夜使者索拉卡,
        //            黎明使者索拉卡,暗星女皇拉克丝,耀星女皇拉克丝,春晖神女,源计划刀妹,星守索拉卡,勇者阿狸,永恒之森霞,,SSG霞,周年女刀,战斗学院拉克丝,银河魔装机神安妮",
        //            "must":true,
//    String rmtx;
    String code15;
        //{
        //            "id":"333500",
        //            "keyname":"至臻皮肤",
        //            "keyid":"code16",
        //            "type":"checkbox",
        //            "value":"无,至臻 K/DA 阿狸,至臻 K/DA 阿狸 (2022),至臻 K/DA 阿卡丽,至臻 K/DA 阿卡丽 (2022),至臻 K/DA ALL OUT 卡莎,至臻
        //            K/DA 卡莎,至臻 K/DA 卡莎 (2022),至臻 K/DA 伊芙琳,至臻 K/DA 伊芙琳 (2022),至臻 征服者 贾克斯,至臻 真实伤害 亚索,至臻 真实伤害 赛娜,至臻
        //            真实伤害 奇亚娜,至臻 战斗学院 蕾欧娜,至臻 战斗学院 拉克丝,至臻 战斗学院 拉克丝 (2022),至臻 月蚀骑士 赛娜,至臻 源计划：正义 艾瑞莉娅,至臻 源计划：正义 艾瑞莉娅
        //            (2022),至臻 源计划：阴 劫,至臻 源计划：逆流 塞拉斯,至臻 玉剑传说 武剑仙,至臻 玉剑传说 武剑仙 (2022),至臻 焰执事 布兰德,至臻 腥红之月 亚托克斯,至臻 星之守护者
        //            索拉卡,至臻 星之守护者 妮蔻,至臻 星之守护者 妮蔻 (2022),至臻 星之守护者 艾克,至臻 星之守护者 辛德拉,至臻 太空律动 “节奏幻师” 璐璐,至臻 神龙尊者 炎龙瑟提,至臻
        //            神龙尊者 均衡之龙 沃利贝尔,至臻 神凰行者 烈羽焰凰 霞,至臻 绒毛菲兹,至臻 绒毛菲兹 (2022),至臻 青花瓷 拉克丝,至臻 女帝 黛安娜,至臻 魔女 乐芙兰,至臻 魔女 婕拉,至臻
        //            魅惑女巫 莫甘娜,至臻 魅惑女巫 厄运小姐,至臻 魅惑女巫 厄运小姐 (2022),至臻 灵能特工 伊泽瑞尔,至臻 灵魂莲华 提莫,至臻 烈焰美人 薇恩,至臻 烈焰美人 薇恩 (2022),
        //            至臻 幻灵战斗猫 金克丝,至臻 黑夜使者 李青,至臻 黑夜使者 李青 (2022),至臻 黑夜使者 凯隐,至臻 福牛守护者 菲奥娜,至臻 飞升战神 潘森,至臻 电玩女神 凯特琳,至臻
        //            电玩女神 凯特琳 (2022),至臻 奥术师 佐伊,至臻 暗星 墨菲特,至臻 西部魔影 猎天使恶魔 泰隆,至臻 海之歌 萨勒芬妮,至臻 未来战士 卢锡安,至臻 未来战士 锤石,至臻 未来战士
        //            锤石 (2022),至臻 太空律动 “魔音海妖” 娜美,至臻 王国机神玄武 盖伦,至臻 海珀利安小队 X09-星环灵风 迦娜,至臻 灵魂莲华 易,至臻 至高天 奎桑提",
        //            "must":true,
//    String zzpf;
    String code16;
        // "id":"333501",
        //            "keyname":"海克斯皮肤",
        //            "keyid":"code17",
        //            "type":"checkbox",
        //            "value":"无,海克斯科技 阿利斯塔,海克斯科技 阿木木,海克斯科技 安妮,海克斯科技 波比,海克斯科技 崔丝塔娜,海克斯科技 吉格斯,海克斯科技 嘉文四世,海克斯科技 卡萨丁,
        //            海克斯科技 克格莫,海克斯科技 拉莫斯,海克斯科技 雷克顿,海克斯科技 玛尔扎哈,海克斯科技 魔腾,海克斯科技 瑟庄妮,海克斯科技 斯维因,海克斯科技 迦娜,灰烬骑士 派克,灰烬征服者
        //            潘森,恐惧新星 德莱厄斯,零之枪骑 赫卡里姆,摄魂使者 薇恩,新创战纪 希维尔",
        //            "must":true,
//    String hkspf;
    String code17;
        // {
        //            "id":"333502",
        //            "keyname":"珍稀限定",
        //            "keyid":"code18",
        //            "type":"checkbox",
        //            "value":"无,至死不渝 瑞兹,莲花之令 卡尔玛,冰原核弹 古拉加斯,龙的传人 李青,安妮梦游仙境,巨角幻兽 阿利斯塔,暗黑灵魂 阿利斯塔,哥特萝莉 安妮,庆典女皇 艾尼维亚,生化领主
        //            泰达米尔,奥斯曼大帝 泰达米尔,奥斯曼大帝 普朗克,银白审判 凯尔,钢铁军团 拉克丝,战熊骑士 瑟庄妮,元老议会 玛尔扎哈,青年 瑞兹,守护者雕像 瑞兹,创星之灵 璐璐,冰原狙击 凯特琳,
        //            粉色萝莉 崔丝塔娜,万夫莫开 贾克斯,舞会公主 安妮,养蜂人 辛吉德,国王 泰达米尔,诸神的黄昏 泰达米尔",
        //            "must":true,
//    String zxxd;
    String code18;
        // "id":"333503",
        //            "keyname":"年限皮肤",
        //            "keyid":"code19",
        //            "type":"checkbox",
        //            "value":"无,龙的传人 李青,银龙裁决 泰隆,古琴余韵 娑娜,定海神珍 孙悟空,神龙烈焰 金克丝,醒狮 克格莫,“你看见过我的熊猫吗？”安妮,神龙之翼 库奇,春晖神女 拉克丝,
        //            广寒仙子 嫦娥,紫金罗刹 莫甘娜,替父从军 花木兰,玉净夜叉 凯特琳,碧玉之牙 卡西奥佩娅,虎痴之拳 蔚,司马懿 仲达,张辽 文远,南天之怒 沃里克 ,美猴王 孙悟空,烈焰美人 薇恩,
        //            金猪烈焰 瑟庄妮,北辰之威 内瑟斯,王国机神青龙 德莱文,王国机神朱雀 蕾欧娜,王国机神苍狼 瑟提,王国机神白虎 贾克斯,王国机神玄武 盖伦,福牛守护者 安妮,福牛守护者 厄斐琉斯,
        //            福牛守护者 德莱厄斯,福牛守护者 阿利斯塔,福牛守护者 嘉文四世,福牛守护者 菲奥娜,福牛守护者 佛耶戈,纳财大帝 塔姆",
        //            "must":true,
//    String lxpf;
    String code19;
        // "id":"333504",
        //            "keyname":"情人节限定",
        //            "keyid":"code20",
        //            "type":"checkbox",
        //            "value":"无,甜心宝贝 安妮,甜心宝贝 娑娜,甜心之羽 霞,甜心之翎 洛,碎心之拳 蔚,穿心之剑 菲奥娜,觅心萝莉 金克丝,觅心猎手 薇恩,觅心之翼 奎因,觅心游侠 卢锡安,觅心猫猫
        //            悠米,觅心女王 艾希,觅心魔灵 奥莉安娜,幽梦玫瑰 辛德拉,幽梦玫瑰 泰隆,幽梦玫瑰 泽丽,幽梦玫瑰 伊莉丝,水晶玫瑰 阿克尚,水晶玫瑰 斯维因,水晶玫瑰 婕拉,水晶玫瑰 迦娜",
        //            "must":true,
//    String qrjxd;
    String code20;
            // "id":"333505",
            //            "keyname":"冰雪限定",
            //            "keyid":"code21",
            //            "type":"checkbox",
            //            "value":"无,冬境仙灵 索拉卡,平安夜女神 娑娜,冰雪风暴 希维尔,圣诞老人 布隆,圣诞老人 德莱文,冰封王子 蒙多,狂心冰王 图奇,持胡萝卜的雪人 易,魄罗骑士 瑟庄妮,
            //            冰雪驯鹿 波比,夺命美人 卡特琳娜,圣诞糖果棒 厄运小姐,圣诞捣蛋鬼 金克丝,冰雪女神 辛德拉,寒冬精灵 璐璐,冬季仙境 卡尔玛,冬季仙境 奥莉安娜",
            //            "must":true,
//    String bxxd;
    String code21;
            //"id":"333506",
            //            "keyname":"珍稀炫彩",
            //            "keyid":"code22",
            //            "type":"checkbox",
            //            "value":"无,龙的传人 李青 潜龙勿用,龙的传人 李青 跃龙在渊,龙的传人 李青 飞龙在天,龙的传人 李青 亢龙有悔,龙的传人 李青 乘龙御天,龙的传人 李青 见龙在田,
            //            龙的传人 李青 龙战于野,龙的传人 李青 龙德而隐",
            //            "must":true,
//    String zxxc;
    String code22;

}
