<template>
  <el-dialog
    title="使用教程"
    :visible.sync="centerDialogVisible"
    width="600px"
    center>
    <div class="web-box">
      <!-- <h3>使用教程</h3> -->
      <p>
        {{tip}}
      </p>
      <!-- <p>如何查询商品是否处于在售中。</p>
      <p>1.输入外部对接编号xyr开头的编号例如：【xyr188888】输入188888点击搜索即可查看该账号是否在出售，【商品状态：查询出来的字是绿色的代表可以正常出售，号还在，红色的代表账号已售或者有问题】</p>
      <p>如何提号</p>
      <p>1.查询出来商品之后有提号按钮，点击提号按钮 输入换绑手机，微信的输入买家手机号，勾选自己需要的截图，备注可以填写客户的要求以及其他信息</p>
      <p>交易中状态说明</p>
      <p>点击提号输入换绑信息提交之后进入交易中，后面有一个一键复制，复制出来的信息带着换绑信息以及其他信息，可以不用复制在交易中的账号会有客服进行跟进 提交之后只需要在群里喊一下提号即可。客服就可以看到你要提的账号</p>
      <p>已完成状态说明</p>
      <p>已完成代表已经换绑成功 换绑信息以及账号密码都在已完成信息里面，点击换绑信息，一键复制给买家即可</p>
      <p>交易失败状态说明</p>
      <p>交易失败则是问题交易失败的订单 建议大家提交失败原因 我们根据失败原因去不断做优化 争取将失败率降低。</p> -->
    </div>
  </el-dialog>
</template>

<script>
export default {
  name: "pick",
  data() {
    return {
    centerDialogVisible:false,
    tip: 
`如何查询商品是否处于在售中？
    输入外部对接编号xyr开头的编号例如：【xyr188888】输入188888点击搜索即可查看该账号是否在出售，【商品状态：查询出来的字是绿色的代表可以正常出售，号还在，红色的代表账号已售或者有问题】

如何提号？
    查询出来商品之后有提号按钮，点击提号按钮 输入换绑手机，微信的输入买家手机号，勾选自己需要的截图，备注可以填写客户的要求以及其他信息

交易中状态说明？
    点击提号输入换绑信息提交之后进入交易中，后面有一个一键复制，复制出来的信息带着换绑信息以及其他信息，可以不用复制在交易中的账号会有客服进行跟进 提交之后只需要在群里喊一下提号即可。客服就可以看到你要提的账号

已完成状态说明：
    已完成代表已经换绑成功 换绑信息以及账号密码都在已完成信息里面，点击换绑信息，一键复制给买家即可

交易失败状态说明：
    交易失败则是问题交易失败的订单 建议大家提交失败原因 我们根据失败原因去不断做优化 争取将失败率降低。

投诉建议：
    感谢你选择我们，在合作期间有任何不满意可以直接打电话给我沟通电话19139006222.相互合作资源互通互卖。`
    }
  },
  methods: {
open(){
this.centerDialogVisible = true
}
  }
};
</script>
<style scoped lang="scss">
  .web-box{
    height: 700px;
    overflow-y: auto;
    word-wrap: break-word;
    white-space: pre-wrap;
    h3{
      text-align: center;
      font-size: 16px;
      font-weight: 600;
    }
    p{
      font-size: 16px;
      line-height: 2em;
    }
  }
</style>
