package com.ruoyi.system.model.dto;

/**
 * @author: yuancaihua
 * @date: 2018/10/8 14:40
 */
public enum ResultEnum {


    //RPC层调用错误码
    SUCCESS(1000, "成功"),
    UNKONW_ERROR(1001, "error"),
    FAILED(1002, "异常"),

    ADD_FAILED(1003, "添加失败"),
    DELETE_FAILED(1004, "删除失败"),
    UPDATE_FAILED(1005, "更新失败"),
    SELECT_FAILED(1006, "查询失败"),
    UPLOAD_SUCCESS(1007, "上传成功"),
    UPLOAD_FAILED(1008, "上传失败"),

    EXCEL_IMPORT_SIZE_ERROR(1009, "导入数据不能"),
    EXCEL_IMPORT_DATA_ERROR(1010, "导入数据有误"),
    EXCEL_IMPORT_FILE_ERROR(1011, "导入文件有误"),

    PROCEDURE_FAILED(1012, "流程异常"),
    PARAMETER_ERROR(1013, "参数错误"),
    TOKEN_ERROR(1014, "用户身份过期,跳转登录页面"),
    LOGIN_ERROR(1015, "该用户已经在别处登录"),

    NUMBER_FORMAT(1016, "字段格式有误"),

    EXCEL_IMPORT_FILE_TYPE_ERROR(1017, "批量导入文件,只能上传Excel文件"),

    UN_USE_API(1018, "该接口已不使用"),

    EXCEL_IMPORT_SIZE_MAX_ERROR(1019, "导入文件过大"),
    EXCEL_IMPORT_NO_DATA_ERROR(1020, "请添加数据"),


    E1201(1201, "零件类型编号已存在"),
    E1202(1202, "零件类型已被使用,不能删除"),
    E1203(1203, "零件类型名称已存在"),


    E1211(1211, "零件编号+零件软件ID已存在"),
    E1220(1220, "零件不存在"),
    E1225(1225, "该零件已经配置版本,不能删除"),
    E1226(1226, "该零件已经配置车型配置,不能删除"),
    E1227(1227, "零件或版本号错误"),


    E1221(1221, "该零件版本已经存在"),
    E1222(1222, "该零件版本有关联的任务处于发布中或者策略处于测试中"),
    E1223(1223, "零件ID为空"),
    E1224(1224, "零件名称已存在"),
    E1229(1229, "零件升级包签名或加密失败"),
    E1228(1228, "版本存在差分关系"),
    E1230(1230, "添加失败!零件数量已达上限，请联系管理员解决。"),
    E1231(1231, "版本不存在"),
    E1232(1232, "未配置零件版本，请先配置好零件升级版本"),
    E1233(1233, "版本已应用在策略或任务中，删除相关策略或任务会失效"),
    E1234(1234, "未上传软件包，请不要填写原始包大小的值"),
    E1235(1235, "目标版本未配置软件包"),
    E1236(1236, "差分关系未配置差分包或不是有效的差分配置"),
    E1237(1237, "版本间未发现差分关系"),
    E1238(1238, "做包工具在做包服务器上不存在"),
    E1239(1239, "整包在线做包失败"),

    E1901(1901, "差分包路径不能为空"),
    E1902(1902, "差分配置已存在"),
    E1903(1903, "上传差分包成功"),
    E1904(1904, "该差分有关联的任务处于发布中或者策略处于测试中"),
    E1905(1905, "当前差分不能删除"),
    E1906(1906, "手动上传差分包签名或者加密失败"),
    E1907(1907, "差分已应用在策略或任务中，删除相关策略或任务会失效"),

    /**
     * 车辆模块 16
     */
    E1601(1601, "车辆已绑定策略"),
    E1602(1602, "有关联任务在发布中"),
    E1603(1603, "vin已存在"),

    /**
     * 车型模块 17
     */
    E1701(1701, "车型不存在"),
    E1702(1702, "失败！配置码已存在"),
    E1703(1703, "车型已存在"),
    E1704(1704, "车型下已存在车辆，不能删除"),
    E1705(1705, "该车型配置下已存在车辆，不能删除"),
    E1706(1706, "车型图片格式只能为jpg,jpeg,png,bmp"),
    E1707(1707, "添加失败!车型数量已达上限，请联系管理员解决。"),

    /**
     * 车型零件模块
     */
    E1801(1801, "请选择零件"),
    E1802(1802, "零件类型不存在"),
    E1803(1803, "零件类型不同不能换位"),
    E1804(1804, "不能换位"),
    E1805(1805, "零件不存在"),
    E1806(1806, "找不到车型零件"),
    E1807(1807, "操作方式错误"),
    E1808(1808, "该车辆下无些零件"),
    E1809(1809, "该车型配置下无零件"),
    E1810(1810, "目标位置异常"),
    E1811(1811, "该车型零件下有关联的策略和任务处于发布中"),
    E1812(1812, "该车型配置零件下有关联的策略和任务处于发布中"),

    /**
     * 策略
     */
    E2001(2001, "策略名称已存在"),
    E2002(2002, "策略已被使用,不能删除"),
    E2003(2003, "策略已被使用,不可修改"),
    E2004(2004, "策略状态错误,不可拷贝"),
    E2005(2005, "版本名称已存在"),
    E2006(2006, "版本号不合法，请输入自然数"),
    E2007(2007, "版本号按升序添加，已存在更高版本号"),
    E2008(2008, "不合法的版本名称，请重新输入"),
    E2009(2009, "没有找到供应商测试"),
    E2010(2010, "当前版本号不能小于之前的版本号"),
    E2011(2011, "不存在差分关系"),
    E2012(2012, "参数异常"),
    E2013(2013, "版本号格式不正确"),
    E2014(2014, "只有新建状态的才能删除"),
    E2015(2015, "策略状态不是待测试，不能绑定车辆"),

    /**
     * 测试模块
     */
    E2101(2101, "所选零件不在列表内"),
    E2102(2102, "请选择升级零件"),

    /**
     * 任务配置模块
     */
    E2201(2201, "任务已存在"),
    E2202(2202, "有关联任务已发布"),
    E2203(2203, "查询到多个任务"),
    E2204(2204, "没有找到车辆信息"),
    E2205(2205, "没有找到车辆有关联的任务处于发布中"),
    E2206(2206, "找到关联任务,但在车辆表里没有找到vin"),

    /**
     * 推送模块
     */
    E2301(2301, "任务不是已发布状态"),

    /**
     * 品牌 33
     */
    E3301(3301, "品牌名称不能为空"),
    E3302(3302, "品牌编码不能为空"),
    E3303(3303, "品牌名称已存在"),
    E3304(3304, "品牌id不能为空"),
    E3305(3305, "品牌已被使用,不能删除"),
    E3306(3306, "品牌编码已存在"),

    /**
     * 车厂 34
     */
    E3401(3401, "厂商编码不能为空"),

    /**
     * 供应商 36
     */
    E3601(3601, "供应商编码不能为空"),
    E3602(3602, "供应商名称不能为空"),
    E3603(3603, "供应商id不能为空"),
    E3604(3604, "供应商已被使用,不能删除"),
    E3605(3605, "供应商名称已存在"),
    E3606(3606, "供应商编码已存在"),

    /**
     * 数据字典 44
     */
    E4401(4401, "数据索引已存在"),


    /**
     * 统计模块
     */
    E4601(4601, "找不到相关的sessionId");

    private String msg;
    private Integer code;

    private ResultEnum(int code, String msg) {
        this.code = code;
        this.msg = msg;
    }

    public String getMsg() {
        return this.msg;
    }

    public Integer getCode() {
        return this.code;
    }

}
