package com.ruoyi.system.outto.core;

public class WYConstant {
    public static String tiaozhandashi = "[\n" +
            "        {\n" +
            "          \"key\": \"6白虎\",\n" +
            "          \"value\": \"6白虎\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"6黑骑\",\n" +
            "          \"value\": \"6黑骑\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"神圣爆裂者\",\n" +
            "          \"value\": \"神圣爆裂者\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"机甲撕裂者\",\n" +
            "          \"value\": \"机甲撕裂者\"\n" +
            "        }\n" +
            "      ]";
    public static String baozoushenghua = "[\n" +
            "        {\n" +
            "          \"key\": \"斯泰尔-蝴蝶\",\n" +
            "          \"value\": \"斯泰尔-蝴蝶\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"迷你小刚\",\n" +
            "          \"value\": \"迷你小刚\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"毒蜂\",\n" +
            "          \"value\": \"毒蜂\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"死亡之眼\",\n" +
            "          \"value\": \"死亡之眼\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"6烈龙\",\n" +
            "          \"value\": \"6烈龙\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"6炼狱\",\n" +
            "          \"value\": \"6炼狱\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"6盘龙\",\n" +
            "          \"value\": \"6盘龙\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"5烈龙\",\n" +
            "          \"value\": \"5烈龙\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"5盘龙\",\n" +
            "          \"value\": \"5盘龙\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"5炼狱\",\n" +
            "          \"value\": \"5炼狱\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"沙漠玫瑰\",\n" +
            "          \"value\": \"沙漠玫瑰\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"超级对讲机\",\n" +
            "          \"value\": \"超级对讲机\"\n" +
            "        }\n" +
            "      ]";

    public static String renmenrenwu = "[\n" +
            "        {\n" +
            "          \"key\": \"传说女帝\",\n" +
            "          \"value\": \"传说女帝\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"沙漠玫瑰\",\n" +
            "          \"value\": \"沙漠玫瑰\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"迷迭香\",\n" +
            "          \"value\": \"迷迭香\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"云悠悠\",\n" +
            "          \"value\": \"云悠悠\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"王者葵貂蝉\",\n" +
            "          \"value\": \"王者葵貂蝉\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"鹰\",\n" +
            "          \"value\": \"鹰\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"王者-炫\",\n" +
            "          \"value\": \"王者-炫\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"春\",\n" +
            "          \"value\": \"春\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"王者春\",\n" +
            "          \"value\": \"王者春\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"王者玲珑\",\n" +
            "          \"value\": \"王者玲珑\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"王者玲珑-小乔\",\n" +
            "          \"value\": \"王者玲珑-小乔\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"雨棠\",\n" +
            "          \"value\": \"雨棠\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"影豹\",\n" +
            "          \"value\": \"影豹\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"王者涂鸦\",\n" +
            "          \"value\": \"王者涂鸦\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"职业选手\",\n" +
            "          \"value\": \"职业选手\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"新海豹突击队\",\n" +
            "          \"value\": \"新海豹突击队\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"旧海豹突击队\",\n" +
            "          \"value\": \"旧海豹突击队\"\n" +
            "        }\n" +
            "      ]";

    public static String remenshoulei = "[\n" +
            "        {\n" +
            "          \"key\": \"雷暴\",\n" +
            "          \"value\": \"雷暴\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"幻兽\",\n" +
            "          \"value\": \"幻兽\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"幻灵\",\n" +
            "          \"value\": \"幻灵\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"夜魔\",\n" +
            "          \"value\": \"夜魔\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"雷霆\",\n" +
            "          \"value\": \"雷霆\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"堕天神\",\n" +
            "          \"value\": \"堕天神\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"电竞装甲\",\n" +
            "          \"value\": \"电竞装甲\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"竞技荣光\",\n" +
            "          \"value\": \"竞技荣光\"\n" +
            "        }\n" +
            "      ]";

    public static String remenshouqiang = "[\n" +
            "        {\n" +
            "          \"key\": \"USP雷暴\",\n" +
            "          \"value\": \"USP雷暴\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"柯尔特-荣耀世冠\",\n" +
            "          \"value\": \"柯尔特-荣耀世冠\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"柯尔特-竞技荣光\",\n" +
            "          \"value\": \"柯尔特-竞技荣光\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"COP-雷霆\",\n" +
            "          \"value\": \"COP-雷霆\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"COP-堕天神\",\n" +
            "          \"value\": \"COP-堕天神\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"沙鹰-幻兽\",\n" +
            "          \"value\": \"沙鹰-幻兽\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"猫猫COP\",\n" +
            "          \"value\": \"猫猫COP\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"COP-白鲨\",\n" +
            "          \"value\": \"COP-白鲨\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"COP-幻灵\",\n" +
            "          \"value\": \"COP-幻灵\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"破空冰刃\",\n" +
            "          \"value\": \"破空冰刃\"\n" +
            "        }\n" +
            "      ]";

    public static String remenwuqi = "[\n" +
            "        {\n" +
            "          \"key\": \"火麒麟\",\n" +
            "          \"value\": \"火麒麟\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"雷神\",\n" +
            "          \"value\": \"雷神\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"荣耀世冠-火麒麟\",\n" +
            "          \"value\": \"荣耀世冠-火麒麟\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"荣耀世冠-雷神\",\n" +
            "          \"value\": \"荣耀世冠-雷神\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"传说光耀\",\n" +
            "          \"value\": \"传说光耀\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"传说暗裔\",\n" +
            "          \"value\": \"传说暗裔\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"QBZ金色蔷薇\",\n" +
            "          \"value\": \"QBZ金色蔷薇\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"Scar白虎\",\n" +
            "          \"value\": \"Scar白虎\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"王者白虎\",\n" +
            "          \"value\": \"王者白虎\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"烈龙\",\n" +
            "          \"value\": \"烈龙 \"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"盘龙\",\n" +
            "          \"value\": \"盘龙 \"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"炼狱\",\n" +
            "          \"value\": \"炼狱 \"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"HK417-朱雀\",\n" +
            "          \"value\": \"HK417-朱雀 \"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"黑骑士\",\n" +
            "          \"value\": \"黑骑士\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"毁灭\",\n" +
            "          \"value\": \"毁灭  \"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"黑龙\",\n" +
            "          \"value\": \"黑龙 \"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"裁决\",\n" +
            "          \"value\": \"裁决\"\n" +
            "        }\n" +
            "      ]";

    public static String yinxiaobao = "[\n" +
            "        {\n" +
            "          \"key\": \"幻神音效卡\",\n" +
            "          \"value\": \"幻神音效卡\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"雷神音效卡\",\n" +
            "          \"value\": \"雷神音效卡\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"火麒麟音效卡\",\n" +
            "          \"value\": \"火麒麟音效卡\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"毁灭音效卡\",\n" +
            "          \"value\": \"毁灭音效卡\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"QBZ音效卡\",\n" +
            "          \"value\": \"QBZ音效卡\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"98k音效卡\",\n" +
            "          \"value\": \"98k音效卡\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"白虎音效卡\",\n" +
            "          \"value\": \"白虎音效卡\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"黑龙音效卡\",\n" +
            "          \"value\": \"黑龙音效卡\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"裁决音效卡\",\n" +
            "          \"value\": \"裁决音效卡\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"黑骑士音效卡\",\n" +
            "          \"value\": \"黑骑士音效卡\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"极光音效卡\",\n" +
            "          \"value\": \"极光音效卡\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"白鲨语音包\",\n" +
            "          \"value\": \"白鲨语音包\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"绝迹语音包\",\n" +
            "          \"value\": \"绝迹语音包\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"70KG语音包\",\n" +
            "          \"value\": \"70KG语音包\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"念旧语音包\",\n" +
            "          \"value\": \"念旧语音包\"\n" +
            "        }\n" +
            "      ]";

    public static String  remenpifu = "[\n" +
            "        {\n" +
            "          \"key\": \"幻神-宠儿\",\n" +
            "          \"value\": \"幻神-宠儿\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"幻神-冠军之幻\",\n" +
            "          \"value\": \"幻神-冠军之幻\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"幻神-AG17冠军\",\n" +
            "          \"value\": \"幻神-AG17冠军\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"幻神-周瑜\",\n" +
            "          \"value\": \"幻神-周瑜\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"幻神-丹凤\",\n" +
            "          \"value\": \"幻神-丹凤\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"幻神-青鹤\",\n" +
            "          \"value\": \"幻神-青鹤\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"幻神-黄忠\",\n" +
            "          \"value\": \"幻神-黄忠\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"雷神-荣耀之魄\",\n" +
            "          \"value\": \"雷神-荣耀之魄\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"雷神-宠儿\",\n" +
            "          \"value\": \"雷神-宠儿\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"雷神-传奇N9\",\n" +
            "          \"value\": \"雷神-传奇N9\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"雷神-荣耀世冠AG\",\n" +
            "          \"value\": \"雷神-荣耀世冠AG\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"雷神-LGD18冠军\",\n" +
            "          \"value\": \"雷神-LGD18冠军\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"雷神-冠军之魄\",\n" +
            "          \"value\": \"雷神-冠军之魄\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"雷神-虎牙\",\n" +
            "          \"value\": \"雷神-虎牙\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"雷神-斗鱼\",\n" +
            "          \"value\": \"雷神-斗鱼\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"雷神-白鲨14冠军\",\n" +
            "          \"value\": \"雷神-白鲨14冠军\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"雷神-CFPL十周年臻藏版\",\n" +
            "          \"value\": \"雷神-CFPL十周年臻藏版\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"火麒麟-EVEN\",\n" +
            "          \"value\": \"火麒麟-EVEN\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"火麒麟-横秒之巅\",\n" +
            "          \"value\": \"火麒麟-横秒之巅\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"火麒麟-CFS2018\",\n" +
            "          \"value\": \"火麒麟-CFS2018\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"火麒麟-冠军之心\",\n" +
            "          \"value\": \"火麒麟-冠军之心\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"火麒麟-虎牙\",\n" +
            "          \"value\": \"火麒麟-虎牙\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"火麒麟-斗鱼\",\n" +
            "          \"value\": \"火麒麟-斗鱼\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"火麒麟-企鹅电竞\",\n" +
            "          \"value\": \"火麒麟-企鹅电竞\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"火麒麟-白虎\",\n" +
            "          \"value\": \"火麒麟-白虎\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"火麒麟-枪娘\",\n" +
            "          \"value\": \"火麒麟-枪娘\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"火麒麟-荣耀世冠AG\",\n" +
            "          \"value\": \"火麒麟-荣耀世冠AG\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"火麒麟-轻语\",\n" +
            "          \"value\": \"火麒麟-轻语\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"毁灭-荣耀之怒\",\n" +
            "          \"value\": \"毁灭-荣耀之怒\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"毁灭-CFS2018\",\n" +
            "          \"value\": \"毁灭-CFS2018\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"毁灭-冠军之怒\",\n" +
            "          \"value\": \"毁灭-冠军之怒\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"毁灭-虎牙\",\n" +
            "          \"value\": \"毁灭-虎牙\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"毁灭AG冠军\",\n" +
            "          \"value\": \"毁灭AG冠军\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"毁灭-2020\",\n" +
            "          \"value\": \"毁灭-2020\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"毁灭-SV16冠军\",\n" +
            "          \"value\": \"毁灭-SV16冠军\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"黑骑士-冠军之势\",\n" +
            "          \"value\": \"黑骑士-冠军之势\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"黑骑士-虎牙\",\n" +
            "          \"value\": \"黑骑士-虎牙\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"黑骑士-马超\",\n" +
            "          \"value\": \"黑骑士-马超\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"黑骑士-地狱火\",\n" +
            "          \"value\": \"黑骑士-地狱火\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"黑骑士-S4冠军\",\n" +
            "          \"value\": \"黑骑士-S4冠军\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"龙啸-冠军之啸\",\n" +
            "          \"value\": \"龙啸-冠军之啸\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"星神-璀璨\",\n" +
            "          \"value\": \"星神-璀璨\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"荣耀之锋\",\n" +
            "          \"value\": \"荣耀之锋\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"屠龙-荣耀世冠AG\",\n" +
            "          \"value\": \"屠龙-荣耀世冠AG\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"冠军之击\",\n" +
            "          \"value\": \"冠军之击\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"key\": \"黑龙-冠军之武\",\n" +
            "          \"value\": \"黑龙-冠军之武\"\n" +
            "        }\n" +
            "      ]";

    public static String  remenjuji = "[\n" +
            "        {\n" +
            "            \"value\":\"M200-幻神\",\n" +
            "            \"key\":\"M200-幻神\"\n" +
            "        },\n" +
            "        {\n" +
            "            \"value\":\"M200-竞技荣光\",\n" +
            "            \"key\":\"M200-竞技荣光\"\n" +
            "        },\n" +
            "        {\n" +
            "            \"value\":\"王者幻神\",\n" +
            "            \"key\":\"王者幻神\"\n" +
            "        },\n" +
            "        {\n" +
            "            \"value\":\"98K星神\",\n" +
            "            \"key\":\"98K星神\"\n" +
            "        },\n" +
            "        {\n" +
            "            \"value\":\"王者星神\",\n" +
            "            \"key\":\"王者星神\"\n" +
            "        },\n" +
            "        {\n" +
            "            \"value\":\"传说梦魇\",\n" +
            "            \"key\":\"传说梦魇\"\n" +
            "        },\n" +
            "        {\n" +
            "            \"value\":\"传说圣灵\",\n" +
            "            \"key\":\"传说圣灵\"\n" +
            "        },\n" +
            "        {\n" +
            "            \"value\":\"毁灭\",\n" +
            "            \"key\":\"毁灭\"\n" +
            "        }\n" +
            "    ]";
    public static String cfzhanqu = "[\n" +
            "    {\n" +
            "      \"name\": \"北部战区\",\n" +
            "      \"id\": \"645\",\n" +
            "      \"serverlist\": [\n" +
            "        {\n" +
            "          \"name\": \"山东\",\n" +
            "          \"id\": \"646\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"name\": \"北京\",\n" +
            "          \"id\": \"647\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"name\": \"辽宁\",\n" +
            "          \"id\": \"648\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"name\": \"河北\",\n" +
            "          \"id\": \"649\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"name\": \"山西\",\n" +
            "          \"id\": \"650\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"name\": \"黑龙江\",\n" +
            "          \"id\": \"651\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"name\": \"吉林\",\n" +
            "          \"id\": \"652\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"name\": \"北方\",\n" +
            "          \"id\": \"653\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"name\": \"河南\",\n" +
            "          \"id\": \"654\"\n" +
            "        }\n" +
            "      ]\n" +
            "    },\n" +
            "    {\n" +
            "      \"name\": \"山东\",\n" +
            "      \"id\": \"646\",\n" +
            "      \"serverlist\": null\n" +
            "    },\n" +
            "    {\n" +
            "      \"name\": \"北京\",\n" +
            "      \"id\": \"647\",\n" +
            "      \"serverlist\": null\n" +
            "    },\n" +
            "    {\n" +
            "      \"name\": \"辽宁\",\n" +
            "      \"id\": \"648\",\n" +
            "      \"serverlist\": null\n" +
            "    },\n" +
            "    {\n" +
            "      \"name\": \"河北\",\n" +
            "      \"id\": \"649\",\n" +
            "      \"serverlist\": null\n" +
            "    },\n" +
            "    {\n" +
            "      \"name\": \"山西\",\n" +
            "      \"id\": \"650\",\n" +
            "      \"serverlist\": null\n" +
            "    },\n" +
            "    {\n" +
            "      \"name\": \"黑龙江\",\n" +
            "      \"id\": \"651\",\n" +
            "      \"serverlist\": null\n" +
            "    },\n" +
            "    {\n" +
            "      \"name\": \"吉林\",\n" +
            "      \"id\": \"652\",\n" +
            "      \"serverlist\": null\n" +
            "    },\n" +
            "    {\n" +
            "      \"name\": \"北方\",\n" +
            "      \"id\": \"653\",\n" +
            "      \"serverlist\": null\n" +
            "    },\n" +
            "    {\n" +
            "      \"name\": \"河南\",\n" +
            "      \"id\": \"654\",\n" +
            "      \"serverlist\": null\n" +
            "    },\n" +
            "    {\n" +
            "      \"name\": \"东部战区\",\n" +
            "      \"id\": \"655\",\n" +
            "      \"serverlist\": [\n" +
            "        {\n" +
            "          \"name\": \"上海\",\n" +
            "          \"id\": \"656\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"name\": \"福建\",\n" +
            "          \"id\": \"657\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"name\": \"安徽\",\n" +
            "          \"id\": \"658\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"name\": \"江苏\",\n" +
            "          \"id\": \"659\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"name\": \"浙江\",\n" +
            "          \"id\": \"660\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"name\": \"移动\",\n" +
            "          \"id\": \"661\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"name\": \"教育\",\n" +
            "          \"id\": \"662\"\n" +
            "        }\n" +
            "      ]\n" +
            "    },\n" +
            "    {\n" +
            "      \"name\": \"上海\",\n" +
            "      \"id\": \"656\",\n" +
            "      \"serverlist\": null\n" +
            "    },\n" +
            "    {\n" +
            "      \"name\": \"福建\",\n" +
            "      \"id\": \"657\",\n" +
            "      \"serverlist\": null\n" +
            "    },\n" +
            "    {\n" +
            "      \"name\": \"安徽\",\n" +
            "      \"id\": \"658\",\n" +
            "      \"serverlist\": null\n" +
            "    },\n" +
            "    {\n" +
            "      \"name\": \"江苏\",\n" +
            "      \"id\": \"659\",\n" +
            "      \"serverlist\": null\n" +
            "    },\n" +
            "    {\n" +
            "      \"name\": \"浙江\",\n" +
            "      \"id\": \"660\",\n" +
            "      \"serverlist\": null\n" +
            "    },\n" +
            "    {\n" +
            "      \"name\": \"移动\",\n" +
            "      \"id\": \"661\",\n" +
            "      \"serverlist\": null\n" +
            "    },\n" +
            "    {\n" +
            "      \"name\": \"教育\",\n" +
            "      \"id\": \"662\",\n" +
            "      \"serverlist\": null\n" +
            "    },\n" +
            "    {\n" +
            "      \"name\": \"西部战区\",\n" +
            "      \"id\": \"670\",\n" +
            "      \"serverlist\": [\n" +
            "        {\n" +
            "          \"name\": \"四川\",\n" +
            "          \"id\": \"671\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"name\": \"重庆\",\n" +
            "          \"id\": \"672\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"name\": \"陕西\",\n" +
            "          \"id\": \"673\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"name\": \"云南\",\n" +
            "          \"id\": \"674\"\n" +
            "        }\n" +
            "      ]\n" +
            "    },\n" +
            "    {\n" +
            "      \"name\": \"四川\",\n" +
            "      \"id\": \"671\",\n" +
            "      \"serverlist\": null\n" +
            "    },\n" +
            "    {\n" +
            "      \"name\": \"重庆\",\n" +
            "      \"id\": \"672\",\n" +
            "      \"serverlist\": null\n" +
            "    },\n" +
            "    {\n" +
            "      \"name\": \"陕西\",\n" +
            "      \"id\": \"673\",\n" +
            "      \"serverlist\": null\n" +
            "    },\n" +
            "    {\n" +
            "      \"name\": \"云南\",\n" +
            "      \"id\": \"674\",\n" +
            "      \"serverlist\": null\n" +
            "    },\n" +
            "    {\n" +
            "      \"name\": \"南部战区\",\n" +
            "      \"id\": \"663\",\n" +
            "      \"serverlist\": [\n" +
            "        {\n" +
            "          \"name\": \"南方\",\n" +
            "          \"id\": \"669\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"name\": \"广东\",\n" +
            "          \"id\": \"664\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"name\": \"广西\",\n" +
            "          \"id\": \"665\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"name\": \"湖南\",\n" +
            "          \"id\": \"666\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"name\": \"湖北\",\n" +
            "          \"id\": \"667\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"name\": \"江西\",\n" +
            "          \"id\": \"668\"\n" +
            "        }\n" +
            "      ]\n" +
            "    },\n" +
            "    {\n" +
            "      \"name\": \"南方\",\n" +
            "      \"id\": \"669\",\n" +
            "      \"serverlist\": null\n" +
            "    },\n" +
            "    {\n" +
            "      \"name\": \"广东\",\n" +
            "      \"id\": \"664\",\n" +
            "      \"serverlist\": null\n" +
            "    },\n" +
            "    {\n" +
            "      \"name\": \"广西\",\n" +
            "      \"id\": \"665\",\n" +
            "      \"serverlist\": null\n" +
            "    },\n" +
            "    {\n" +
            "      \"name\": \"湖南\",\n" +
            "      \"id\": \"666\",\n" +
            "      \"serverlist\": null\n" +
            "    },\n" +
            "    {\n" +
            "      \"name\": \"湖北\",\n" +
            "      \"id\": \"667\",\n" +
            "      \"serverlist\": null\n" +
            "    },\n" +
            "    {\n" +
            "      \"name\": \"江西\",\n" +
            "      \"id\": \"668\",\n" +
            "      \"serverlist\": null\n" +
            "    }\n" +
            "  ]";
}